IdeaRS.OpenModel.CrossSection.CrossSectionType.CFZ
Cold formed thin-wall Z section

IdeaRS.OpenModel.CrossSection.CrossSectionType.CFZed
Cold formed thin-wall Z section with lips

IdeaRS.OpenModel.CrossSection.CrossSectionType.CFSigma
Cold formed thin-wall sigma section

IdeaRS.OpenModel.CrossSection.CrossSectionType.CFC
Cold formed thin-wall C section

IdeaRS.OpenModel.CrossSection.CrossSectionType.CFU
Cold formed thin-wall Channel section

IdeaRS.OpenModel.CrossSection.CrossSectionType.CFL
Cold formed thin-wall angle section

IdeaRS.OpenModel.CrossSection.CrossSectionType.CFRegPolygon
Cold formed thin-wall regular polygon

IdeaRS.OpenModel.CrossSection.CrossSectionType.CFOmega
Cold formed thin-wall omega section

IdeaRS.OpenModel.CrossSection.CrossSectionType.BoxDelta
Welded box - delta shape

IdeaRS.OpenModel.CrossSection.CrossSectionType.BoxTriangle
Welded box - triangular shape

IdeaRS.OpenModel.CrossSection.CrossSectionType.CF2Co
Cold formed - Pair 2C - opened (back to back)

IdeaRS.OpenModel.CrossSection.CrossSectionType.CFLgen
Cold formed - general angle section